Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: ཆོས་དེ་ཡང་དེའི་ངོ་བོ་ཉིད་མ་ཡིན། ཡི་གེ་དེ་དག་ཀྱང་དེའི་ངོ་བོ་ཉིད་མ་ཡིན་མོད་ཀྱི།
en: Those phenomena are indeed not their essential nature, nor are those words their essential nature.

source: འདི་ནི་མིང་ཙམ་དང་། ཐ་སྙད་ཙམ་དུ་བྱའི། འདི་ལ་མངོན་པར་ཞེན་པར་མི་བྱའོ།
en: They should be considered merely nominal, merely conventional, and so I should not become attached to them.

source: གློ་བུར་དུ་བྱུང་བའི་ཆོས་དེ་ཡང་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པ་མ་ཡིན་ཏེ།
en: Yet neither are these temporary phenomena entirely nothing.

source: གཞན་གྱི་རྐྱེན་དང་། གཞན་གྱི་རྐྱེན་ལ་སྡོད་པ་དང་། གཞན་གྱི་རྐྱེན་རྣམས་ཀྱིས་འབྱུང་ཞིང་རྐྱེན་དང་བྲལ་ན་འགག་པའི་ཆོས་འདི་ནི་ཡོད་དོ་ཞེས་
en: They are extraneous conditions. They depend on extraneous conditions, occur because of extraneous conditions, and cease when separated from those conditions. And in this sense they exist.’

source: དེ་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Bodhisattvas recognize this correctly.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་བདག་མེད་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom regarding the absence of self in phenomena.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཙེ་བ་མ་ཡིན་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom that is not temporary consist in?

source: བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཙེ་བའི་ཡེ་ཤེས་སྐད་ཅིག་གཅིག་ལ་འཇུག་ཅིང་སྐད་ཅིག་གཉིས་པ་ལ་མི་འཇུག་པ་མ་ཡིན་གྱི།
en: The bodhisattvas’ wisdom is not temporary in the sense of being applied in one moment, and then not in the next.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་མཐོང་བ་ནི་སྐད་ཅིག་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པར་འཇུག་སྟེ།
en: The wisdom vision of bodhisattvas is unimpeded throughout all moments.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཙེ་བ་མ་ཡིན་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom that is not temporary.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom of the sphere of absorption consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་ཏིང་ངེ་འཛིན་རྣམས་ཀྱང་རབ་ཏུ་ཤེས། རང་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་རྣམས་ཀྱང་རབ་ཏུ་ཤེས། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྣམས་ཀྱང་རབ་ཏུ་ཤེས། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: Bodhisattvas know the absorptions of the hearers, they know the absorptions of the solitary buddhas, they know the absorptions of the bodhisattvas, and they know all absorptions of the thus-gone ones.

source: དེས་ཏིང་ངེ་འཛིན་གང་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གང་ལ་ཉན་ཐོས་སྤྱོད་པ་དེ་ཡང་རབ་ཏུ་ཤེས།
en: They know the absorptions and associated spheres that the hearers engage in,

source: ཏིང་ངེ་འཛིན་གང་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གང་ལ་རང་སངས་རྒྱས་སྤྱོད་པ་དེ་ཡང་རབ་ཏུ་ཤེས།
en: they know the absorptions and associated spheres that the solitary buddhas engage in,

source: ཏིང་ངེ་འཛིན་གང་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་དེ་ཡང་རབ་ཏུ་ཤེས།
en: they know the absorptions and associated spheres that the bodhisattvas engage in,

source: དེས་ཏིང་ངེ་འཛིན་གང་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གང་ལ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་དེ་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: they know the absorptions and associated spheres that the buddhas engage in.

source: དེ་བཞིན་གཤེགས་པས་སྐབས་ཕྱེ་ན་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་རབ་ཏུ་ཤེས་ཀྱི།
en: However, their knowledge of the spheres of absorptions of the thus-gone ones depends upon the permission of the thus-gone ones.

source: རྣམ་པར་སྨིན་པས་གྲུབ་པའི་རང་གི་ཡེ་ཤེས་ཀྱིས་ནི་མ་ཡིན་ནོ།
en: Such knowledge is not due to a wisdom of their own that has been attained through maturation.

source: ཏིང་ངེ་འཛིན་གཞན་རྣམས་ནི་རྣམ་པར་སྨིན་པས་གྲུབ་པའི་རང་གི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་ཤེས་ཏེ།
en: The other absorptions are, on the other hand, known through their own wisdom as attained by means of maturation.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom of the sphere of absorption.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom of blessings consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱང་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས། རང་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱང་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས། བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་ཀྱང་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ན།
en: Bodhisattvas know correctly the blessings of the hearers, the blessings of the solitary buddhas, and the blessings of the bodhisattvas.

source: སེམས་ཅན་དེ་མ་ཡིན་པ་གཞན་དག་གི་ལྟ་ཅི་སྨོས་ཏེ།
en: Needless to mention, then, that they also know the blessings of other beings.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom of blessings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་འཕྲོགས་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent inalienable wisdom consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ནི་མུ་སྟེགས་ཅན་ཐམས་ཅད་དང་། བདུད་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ་ཡིན་ཏེ།
en: The bodhisattvas’ wisdom cannot be swayed by any non-Buddhist, demon, hearer, or solitary buddha.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་འཕྲོགས་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent inalienable wisdom.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་ལྟ་བའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom that observes the activities of all sentient beings consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཡོངས་སུ་དག་པ་དང་ཞིང་རྙོག་པ་མེད་པས་སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་ལྟ་སྟེ།
en: With their pure, clear, and unsullied wisdom, bodhisattvas observe the realms of sentient beings:

source: དེས་དེ་ན་སེམས་ཅན་ལ་ལ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་དང་། ལ་ལ་བྱང་ཆུབ་ཀྱི་སེམས་མ་བསྐྱེད་པ་དག་དང་།
en: they see that some have aroused the mind of awakening and some have not,

source: ལ་ལ་བྱང་ཆུབ་ཀྱི་སེམས་བསྒྲུབས་པ་དག་དང་། ལ་ལ་བྱང་ཆུབ་ཀྱི་སེམས་མ་བསྒྲུབས་པ་དག་དང་།
en: that some have accomplished the mind of awakening and some have not,

source: ལ་ལ་ས་དང་པོ་ལ་གནས་པ་དག་དང་། ལ་ལ་ས་བཅུའི་བར་ལ་གནས་པ་དག་དང་།
en: that some are on the first ground and some abide on the tenth,

source: ལ་ལ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དག་དང་། ལ་ལ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བ་དག་དང་།
en: that some achieve complete awakening, that some achieve complete awakening and turn the wheel of Dharma,

source: ལ་ལ་བྱ་བ་ཀུན་བྱས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དག་དང་།
en: that some have completed all tasks and pass completely beyond suffering,

source: ལ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དག་དང་།
en: that some pass beyond suffering by means of the Hearers’ Vehicle,

source: ལ་ལ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དག་དང་།
en: that some pass beyond suffering by means of the Solitary Buddhas’ Vehicle,

source: ལ་ལ་བདེ་འགྲོར་སྐྱེ་བ་དག་དང་། ལ་ལ་ངན་འགྲོར་སྐྱེ་བ་དག་མཐོང་ངོ་།
en: that some are born in the higher realms, and that some are born in the lower realms.

source: དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་ལྟ་སྟེ།
en: In this way they observe the activities of all sentient beings.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་ལྟ་བའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom that observes the activities of all sentient beings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྷུན་གྱིས་གྲུབ་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom of spontaneous accomplishment consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་འམ། འགྲེང་བ་འམ། འདུག་པ་འམ། འགྲོ་བ་འམ། འོང་བ་ན་ལྷུན་གྱིས་གྲུབ་ཅིང་ཡེ་ཤེས་འབྱུང་སྟེ།
en: When bodhisattvas act, whether standing, sitting, going, or coming, their activities are spontaneously accomplished occurrences of wisdom.

source: འདི་ལྟ་སྟེ། དཔེར་ན་མི་གཉིད་ཀྱིས་ལོག་པའི་དབུགས་འབྱུང་བ་དང་། རྔུབ་པ་དག་ལྷུན་གྱིས་གྲུབ་ཅིང་འབྱུང་ངོ་།
en: To illustrate this, when a person sleeps, their breathing happens spontaneously.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་དེ་ཡང་དེ་བཞིན་དུ་བལྟའོ།
en: The wisdom of bodhisattvas can be seen in a similar way.

source: ཡེ་ཤེས་དེ་ཡང་ཐམས་ཅད་དུ་མི་ཆགས་པར་འཇུག་སྟེ།
en: And their wisdom, moreover, partakes of everything without obstruction.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྷུན་གྱིས་གྲུབ་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom of spontaneous accomplishment.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཀྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ excellent wisdom concerning the characteristics of all phenomena consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་མཚན་ཉིད་མཚུངས་པར་ཡང་རབ་ཏུ་ཤེས།
en: Bodhisattvas know the characteristics of all phenomena to be equal.

source: མཚན་ཉིད་གཅིག་པར་ཡང་རབ་ཏུ་ཤེས་མཚན་ཉིད་དུ་མར་ཡང་རབ་ཏུ་ཤེས།
en: They know the characteristics to be one and they know the characteristics to be many.

source: སྒྱུ་མའི་མཚན་ཉིད་དུའང་རབ་ཏུ་ཤེས།
en: They know the characteristics to be illusory.

source: ཡང་དག་པ་མ་ཡིན་པར་ཡོངས་སུ་བརྟགས་པའི་མཚན་ཉིད་དུའང་རབ་ཏུ་ཤེས་ཏེ།
en: They know the characteristics to be unreal and imaginary.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཀྱི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Such is the bodhisattvas’ excellent wisdom concerning the characteristics of all phenomena.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཞེ་ན།
en: Noble son, you may wonder about the character of the bodhisattvas’ excellent wisdom that transcends the world.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཟག་པ་མེད་པའི་ཡེ་ཤེས་འཇིག་རྟེན་ཐམས་ཅད་ལས་འདས་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Noble son, bodhisattvas are endowed with undefiled wisdom that transcends the entire world.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ excellent wisdom that transcends the world.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།།
en: Noble son, bodhisattvas who possess these ten qualities are endowed with excellent wisdom.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, bodhisattvas possessing ten qualities are similar to the earth.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡངས་ཤིང་ཚད་མེད་པ་རྣམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་གྱུར་པ་རྣམས་ཡིན། གནོད་པ་དང་ལན་དུ་ཕན་འདོགས་པ་དང་བྲལ་བ་རྣམས་ཡིན། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཀུན་ཟེད་པ་རྣམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པ་རྣམས་ཡིན། དགེ་བའི་ཆོས་ཀྱི་ས་བོན་གྱི་གཞིར་གྱུར་པ་རྣམས་ཡིན། རིན་པོ་ཆེའི་སྣོད་དུ་གྱུར་པ་རྣམས་ཡིན། རྩི་ཆེན་པོའི་སྣོད་དུ་གྱུར་པ་རྣམས་ཡིན། མི་སྒུལ་བ་རྣམས་ཡིན། མི་དངངས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are wide and infinite, provide all beings with sustenance, are indifferent to harm and assistance, absorb the great rain of Dharma, transform all beings, are the ground for the seeds of virtuous qualities, are a vessel of jewels, are a vessel of powerful medicinal plants, are free of trembling, and are unintimidated.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡངས་ཤིང་ཚད་མེད་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas are wide and infinite.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ཆེན་པོ་ནི་ཐམས་ཅད་དུ་ཡངས་ཤིང་ཚད་མེད་དོ།
en: Consider, noble son, the analogy of the wide and infinite earth.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདི་ལྟ་སྟེ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱིས་ཀུན་ཏུ་ཡངས་ཤིང་ཚད་མེད་པ་ཡིན་ཏེ།
en: Similarly, the bodhisattvas’ accumulations of merit and wisdom are wide and infinite.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡངས་ཤིང་ཚད་མེད་པ་ཡིན་ནོ།
en: Thus, bodhisattvas are wide and infinite.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་གྱུར་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, do bodhisattvas provide sustenance for all sentient beings?

source: དཔེར་ན་ས་ཆེན་པོ་ནི་འདི་ལྟར་ཡོ་བྱད་རྣམ་པ་དེ་དང་དེ་དག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་གྱུར་པ་ཡིན་ནོ།
en: Take as an analogy the earth that provides beings with all the things they require.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ལ་སོགས་པ་བྱང་ཆུབ་ཀྱི་ཚོགས་རྣམས་དང་། ཕན་པར་འགྱུར་བའི་ཡོ་བྱད་རྣམ་པ་དུ་མ་དེ་དང་དེ་དག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་གྱུར་པ་ཡིན་ཏེ།
en: Bodhisattvas, similarly, provide all beings with generosity, discipline, patience, diligence, concentration, insight, and other such provisions for awakening, as well as with any sort of article that beings may require.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་གྱུར་པ་ཡིན་ནོ།
en: Thus, bodhisattvas provide sustenance for all sentient beings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གནོད་པ་དང་ལན་དུ་ཕན་འདོགས་པ་དང་བྲལ་བ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas indifferent to harm and assistance?

source: དཔེར་ན་ས་ཆེན་པོ་ནི་གནོད་པས་ཀྱང་ཁོང་ཁྲོ་བར་མི་འགྱུར། ཕན་པས་ཀྱང་ཆགས་པར་མི་འགྱུར་ཏེ།
en: Take as an analogy the earth that neither becomes angered by harm that is done to it, nor develops any attachment when it is benefited.

source: གཉིས་སུ་འདུ་ཤེས་པ་ཡང་མི་འབྱུང་ངོ་།
en: does not distinguish between those situations.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་གནོད་པ་དག་གིས་ཁོང་ཁྲོ་བར་མི་འགྱུར། ཕན་པ་དག་གིས་ཀྱང་ཆགས་པར་མི་འགྱུར་ཏེ།
en: Similarly, bodhisattvas do not become angry at those who harm them, nor do they become attached to those who do them good.

source: དེ་ནི་སེམས་ཅན་དེ་དག་ལ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་ཡང་མི་སྐྱེད་དེ་དེ་ལྟར་ན་
en: Thus, as they neither develop attachment nor anger in their relations with sentient beings,

source: བྱང་ཆུབ་སེམས་དཔའ་གནོད་པ་དང་ལན་དུ་ཕན་འདོགས་པ་དང་བྲལ་བ་ཡིན་ནོ།
en: bodhisattvas are indifferent to harm and assistance.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཀུན་ཟེད་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, do bodhisattvas absorb the great rain of Dharma?

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ཆེན་པོ་ནི་
en: Consider, noble son, the analogy of the earth.

source: སྤྲིན་ཆེན་པོ་ལས་འབབ་པའི་ཆུ་ཀླུང་ཆེན་པོ་ཀུན་ཟེད་དེ། བཟོད་ཅིང་ཀུན་འཛིན་ཏོ་
en: When the rain is pouring down from massive clouds, the earth absorbs the torrents, accommodating and absorbing it.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ལས་ཆོས་ཀྱི་ཆར་པ་ཆེན་པོ་རབ་ཏུ་ཕབ་པ་ཀུན་ཟེད་ཅིང་བཟོད་ལ་འཛིན་ཏེ།
en: Similarly, bodhisattvas absorb the great rain of Dharma as it falls from the great clouds of Dharma, accommodating and absorbing it.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཀུན་ཟེད་པ་ཡིན་ནོ།
en: Thus, bodhisattvas absorb the great rain of Dharma.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, do bodhisattvas transform all beings?

source: སེམས་ཅན་ཐམས་ཅད་འགྲོ་བ་དང་། འོང་བའི་གནས་སུ་གྱུར་པ་ཡིན་ནོ།
en: where the movements of sentient beings unfold.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་འགྲོ་དང་མྱ་ངན་ལས་འདས་པར་འགྲོ་བའི་གནས་སུ་གྱུར་པ་ཡིན་ཏེ།
en: Similarly, for all beings bodhisattvas serve as the basis for going to the higher realms and moving completely beyond suffering.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པ་ཡིན་ནོ།
en: Thus, bodhisattvas transform all beings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་ཆོས་ཀྱི་ས་བོན་གྱི་གཞིར་གྱུར་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas the ground for the seeds of virtuous qualities?

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ས་བོན་ཐམས་ཅད་ནི་ས་ཆེན་པོའི་གཞིར་གྱུར་པ་ལས་སྐྱེའོ།
en: Consider, noble son, the analogy of the earth that is the ground containing all seeds.

source: དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་ཆོས་ཀྱི་ས་བོན་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་གཞིར་གྱུར་པ་ལས་སྐྱེ་སྟེ།
en: Similarly, bodhisattvas are the ground from which the seeds of all the virtuous qualities of all beings sprout.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་ཆོས་ཀྱི་ས་བོན་གྱི་གཞིར་གྱུར་པ་ཡིན་ནོ།
en: Thus, bodhisattvas are the ground that holds the seeds of virtuous qualities.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་སྣོད་དུ་གྱུར་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas vessels of jewels?

source: རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྣོད་ཡིན་ཏེ། ས་ཆེན་པོ་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀུན་སྣང་ངོ་།
en: It contains all sorts of jewels, and all manner of precious stones can be found there.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡོན་ཏན་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྣོད་དུ་གྱུར་པ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡོན་ཏན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀུན་སྣང་སྟེ།
en: Likewise, bodhisattvas are vessels of all sorts of precious qualities, and all manner of such qualities can be found within them.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་སྣོད་དུ་གྱུར་པ་ཡིན་ནོ།
en: Thus, bodhisattvas are vessels of jewels.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྩི་ཆེན་པོའི་སྣོད་དུ་གྱུར་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas vessels of powerful medicinal plants?

source: རྩི་ཆེན་པོ་གང་དག་ནད་རྣམ་པ་སྣ་ཚོགས་ཞི་བར་འགྱུར་བ་དག་ཀྱང་ས་ཆེན་པོ་ལ་གནས་ཏེ་འཇིག་རྟེན་ན་སྣང་ངོ་།
en: All great medicinal plants that remedy all sorts of diseases grow in the earth and emerge from it.

source: དེ་བཞིན་དུ་གང་དག་གིས་ཉོན་མོངས་པའི་ནད་རྣམ་པ་སྣ་ཚོགས་པ་རྣམས་ཞི་བར་འགྱུར་བའི་ཆོས་ཀྱི་རྩི་ཆེན་པོ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་གནས་ཤིང་འཇིག་རྟེན་དུ་སྣང་བར་འགྱུར་ཏེ།
en: Likewise, the great medicinal plants of the Dharma that pacify all the diseases of the afflictions are within the bodhisattvas and emerge from them.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྩི་ཆེན་པོའི་སྣོད་དུ་གྱུར་པ་ཡིན་ནོ།
en: Thus, bodhisattvas are vessels of powerful medicinal plants.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྒུལ་བ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas free of trembling?

source: འདི་ལྟར་ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། རླུང་དང་། ཉི་མ་དང་། སྦྲུལ་གྱིས་རེག་པའི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བ་ཡིན་ནོ།
en: It does not tremble from any pain that comes from contact with the likes of meat flies, bees, the wind, the sun, or snakes.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལས་བྱུང་བའི་ཕྱི་ནང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བ་ཡིན་ཏེ།
en: Bodhisattvas, similarly, do not tremble at any outer or inner pain inflicted by sentient beings.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྒུལ་བ་ཡིན་ནོ།
en: Thus, bodhisattvas are free of trembling.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་དངངས་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas not intimidated?

source: གླང་པོའི་རྒྱལ་པོ་དང་། རི་དགས་ཀྱི་རྒྱལ་པོ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒྲ་ཐོས་ཀྱང་མི་སྐྲག་རབ་ཏུ་མི་སྐྲག་ཤིན་ཏུ་མི་སྐྲག་སྐྲག་པར་མི་འགྱུར་རོ།
en: Even when, for example, the roar of the king of elephants or the king of beasts is heard, the earth remains unafraid, utterly and completely unafraid.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བདུད་དང་མུ་སྟེགས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ཐོས་ན་མི་སྐྲག་རབ་ཏུ་མི་སྐྲག་ཤིན་དུ་མི་སྐྲག་སྐྲག་པར་མི་འགྱུར་ཏེ།
en: Likewise, when the noises of demons and non-Buddhists are heard, bodhisattvas also remain unafraid, utterly and completely unafraid.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་དངངས་པ་ཡིན་ནོ།
en: Thus, noble son, bodhisattvas are not intimidated.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ས་ཆེན་པོ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas possessing these ten qualities are similar to the earth.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་ཆུ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are similar to water.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགེ་བའི་ཆོས་ལ་གཞོལ་བ་རྣམས་ཡིན། དཀར་པོའི་ཆོས་ཐམས་ཅད་སྐྱེད་པ་རྣམས་ཡིན། དགའ་བ་དང་དད་པ་དང་རངས་པའི་གཤེར་བ་ཅན་རྣམས་ཡིན། ཉོན་མོངས་པའི་རྩ་བའི་རྒྱུད་ཐམས་ཅད་སྲུལ་བ་རྣམས་ཡིན། དང་ཞིང་རྙོག་པ་མེད་དེ་གསལ་བ་རྣམས་ཡིན། ཉོན་མོངས་པའི་ཡོངས་སུ་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་པ་རྣམས་ཡིན། འདོད་པ་ལ་སྲེད་པ་ཟློག་པ་རྣམས་ཡིན། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་རྣམས་ཡིན། མཐོན་དམན་འགེངས་པ་རྣམས་ཡིན། ཉོན་མོངས་པའི་རྡུལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་རྣམས་ཡིན་ནོ། །
en: What are those ten? They move in a flow of virtuous qualities; they grow the qualities of goodness; they are moist with joy, faith, and delight; they make the roots of affliction rot; they are limpid, free of murk, and clear; they pacify the torments of affliction; they alleviate craving for pleasure; they are deep and hard to fathom; they flood high and low; and they pacify the dust of affliction.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་ཆོས་ལ་གཞོལ་བ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas move in a flow of virtuous qualities.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཆུ་ནི་གཞོལ་བར་འགྲོ་བ་དང་། གཞོལ་བར་རྒྱུ་བ་ཡིན་ནོ།
en: Consider, noble son, the analogy of water that moves and flows in a stream.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དགེ་བའི་ཆོས་ལ་གཞོལ་ཞིང་དགེ་བའི་ཆོས་ཀྱི་ཕྱིར་རྒྱུ་བ་ཡིན་ཏེ།
en: Bodhisattvas, similarly, move in a stream of virtuous qualities and their movements are guided by virtue.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་ཆོས་ལ་གཞོལ་བ་ཡིན་ནོ།
en: Thus, bodhisattvas move in a flow of virtuous qualities.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དཀར་པོའི་ཆོས་ཐམས་ཅད་སྐྱེད་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas grow the qualities of goodness.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཆུ་ནི་རྩྭ་དང་། ཤིང་གེལ་བ་དང་། རྩི་དང་། ནགས་ཚལ་ཐམས་ཅད་སྐྱེད་དེ། སྐྱེས་པ་རྣམས་ཀྱང་ཕྱིར་ཞིང་རྒྱས་པར་བྱེད་དོ།
en: Consider, noble son, the analogy of water that makes grass, bushes, herbs, and forests sprout and grow.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཏིང་ངེ་འཛིན་གྱི་ཆུས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་རྣམ་པར་བྱེད་དོ།
en: Bodhisattvas, similarly, manifest the factors of awakening with the water of absorption.

source: སྐྱེས་པ་རྣམས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤིང་དུ་གྱུར་གྱི་བར་དུ་ཕྱིར་ཞིང་རྒྱས་པར་བྱེད་དོ། །
en: When they are manifest, they make them expand until they become the tree of omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤིང་དུ་གྱུར་པ་དག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་སེམས་ཅན་རྣམས་འཚོ་བར་འགྱུར་ཏེ།
en: Once the tree of omniscience has manifested, they feed beings with its fruits of awakened qualities.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དཀར་པོའི་ཆོས་ཐམས་ཅད་སྐྱེད་པ་ཡིན་ནོ།
en: Thus, bodhisattvas grow the qualities of goodness.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བ་དང་། དད་པ་དང་། རངས་པའི་གཤེར་བ་ཅན་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas are moist with the qualities of joy, faith, and delight.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཆུ་ནི་ངོ་བོ་ཉིད་ཀྱིས་གཤེར་བ་ཅན་ཡིན་ཏེ། གཞན་ཡང་གཤེར་བར་བྱེད་དོ།
en: Consider, noble son, the analogy of water. Being wet by its very nature, it makes other things wet too.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ངོ་བོ་ཉིད་ཀྱིས་དགའ་བ་དང་། དད་པ་དང་། རངས་པའི་གཤེར་བ་ཅན་ཡིན་ཏེ། སེམས་ཅན་གཞན་ཡང་དགའ་བ་དང་། དད་པ་དང་། རངས་པའི་གཤེར་བ་ཅན་དུ་བྱེད་དོ།
en: Similarly, bodhisattvas are by their very nature moist with joy, faith, and delight, and they also moisten others with the same qualities.

source: དེ་ལ་དགའ་བ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཚོལ་བའོ།
en: Here, joy means searching for the Dharma beyond the world;

source: དད་པ་ནི་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་རྟེན་པའོ།
en: faith means reliance on the Buddha, Dharma, and Saṅgha;

source: རངས་པ་ནི་གང་སེམས་དག་པ་སྟེ།
en: delight means purity of mind.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བ་དང་། དད་པ་དང་། རངས་པའི་གཤེར་བ་ཅན་ཡིན་ནོ།
en: In this way bodhisattvas are moist with the qualities of joy, faith, and delight.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པའི་རྩ་བའི་རྒྱུན་ཐམས་ཅད་སྲུལ་བ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas make the web of the roots of affliction rot.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཆུ་ནི་ཤིང་གི་རྣམ་པ་དང་རྩྭའི་རྣམ་པའི་རྩ་བ་དག་གི་རྒྱུན་ཐམས་ཅད་སྲུལ་ལོ།
en: Consider, noble son, how water can make the web of the roots of trees and grass rot.
